posts/reading/soa-patterns/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SOA Patterns | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/soa-patterns/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../spring-integration-in-action/" title="Spring Integration in Action" type="text/html">
<link rel="next" href="../service-design-patterns/" title="Service Design Patterns" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="SOA Patterns">
<meta property="og:url" content="https://example.com/posts/reading/soa-patterns/">
<meta property="og:description" content="Table of Contents


Solving SOA pains with patterns





Solving SOA pains with patterns


Defining software architecutre:

Software architecture is the collection of fundamental decisions
about a sof">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="patterns">
<meta property="article:tag" content="soa">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">SOA Patterns</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Solving SOA pains with patterns</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Solving SOA pains with patterns</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Defining software architecutre:
<ul class="org-ul">
<li>Software architecture is the collection of fundamental decisions
about a software product or solution designed to meet the
project's quality attributes (the architectural requirements).
</li>
<li>The architecture includes the main components, their main
attributes, and their collaboration to meet the quality attributes.
</li>
<li>Arehitecture can, and usually should, be expressed in several
levels of abstraction, where the number of levels depends on the
project's size and complexity.
</li>
</ul>
</li>
<li>Some comments about software architecture:
<ul class="org-ul">
<li>Architecture represents the set of earliest design decisions that
are both hardest to change and most critical to get right.
</li>
<li>Architecture is an attribute of every system.
</li>
<li>Architecture breaks a system into components and sets boundaries.
</li>
<li>Architecture is about relationships and component interactions.
</li>
<li>Architecture explains the retionale behind the choices. Also it
can be benefical to understand what alternatives were weighed and
abandoned.
</li>
</ul>
</li>
<li>The unit of communicationin SOA is the <code>message</code>.
<ul class="org-ul">
<li>RPC often requires the caller to have intimate knowledge of the
other system's implementation details. With messaging, this isn't
the case.
</li>
<li>Messages have both a header and a body (the payload).
</li>
<li>Messages can come in may different forms:
<ul class="org-ul">
<li>HTTP GET messages,
</li>
<li>Simple Object Access Protocol (SOAP) messages,
</li>
<li>Java Message Service (JMS) messages,
</li>
<li>Simple Mail Transfer Protocol (SMTP) messages.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/patterns/" rel="tag">patterns</a></li>
            <li><a class="tag p-category" href="../../../categories/soa/" rel="tag">soa</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../spring-integration-in-action/" rel="prev" title="Spring Integration in Action">Previous post</a>
            </li>
            <li class="next">
                <a href="../service-design-patterns/" rel="next" title="Service Design Patterns">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
